app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 17]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @game = Game.find(params[:id])
    @played_count = Session.where('game_id = ?', params[:id]).count

    @totals = Session.joins(:session_player)
      .select('session_players.player_id, count(*) as plays, sum(case "placing" when 1 then 1 else 0 end) as wins')
      .where('game_id = ?', params[:id])
      .group('session_players.player_id')
      .order('wins DESC')

    @winner = @totals.first

SELECT "games".* FROM "games"  ORDER BY name
---
  def list
    games = Game.all