app/controllers/players_controller.rb

  def list
    players = params[:include_unknown] ? Player.all : get_filtered_players
---
SELECT "players".* FROM "players"

  def show
    session_id = params[:id].to_i
    not_found if session_id < 0

    @player = Player.find(session_id)
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", 2]]